ДипломДубль/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ДипломДубль/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ТипСуммы</types>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДипломДубль/src/AccumulationRegisters/ВКМ_ПродажиПоАктам/ВКМ_ПродажиПоАктам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ПродажиПоАктам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДипломДубль/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Элементы.ПериодНадпись.Заголовок = Формат(Объект.Период, "ДФ=MMММ.yyyy");
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкты(Команда)     
	ДлительнаяОперация = ВыполнитьДлительныйКодНаСервере();      
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
	ПараметрыОжидания.Интервал = 1; 
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;   
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполнения", ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);      
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);  
КонецПроцедуры

# КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВыполненоРабот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор,
		|	Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыполненоРабот.Договор КАК Договор,
		|	ВыполненоРабот.Клиент КАК Клиент,
		|	ВКМ_ПродажиПоАктамОбороты.Регистратор КАК Реализация
		|ИЗ
		|	ВыполненоРабот КАК ВыполненоРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ПродажиПоАктам.Обороты(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Регистратор,
		|				(Контрагент, Договор) В
		|					(ВЫБРАТЬ
		|						Работы.Клиент,
		|						Работы.Договор
		|					ИЗ
		|						ВыполненоРабот КАК Работы)) КАК ВКМ_ПродажиПоАктамОбороты
		|		ПО ВыполненоРабот.Клиент = ВКМ_ПродажиПоАктамОбороты.Контрагент
		|			И ВыполненоРабот.Договор = ВКМ_ПродажиПоАктамОбороты.Договор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	Договор,
		|	ВКМ_ПродажиПоАктамОбороты.Регистратор.Дата";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Период));

	Объект.СписокРеализаций.Очистить();
	
	Объект.СписокРеализаций.Загрузить(Запрос.Выполнить().Выгрузить());

	
КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительныйКодНаСервере() 
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьСерверныйКод"                  
		, Объект.Период);   
		
	Возврат ДлительнаяОперация;	       

КонецФункции


&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда  
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = (ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		Сообщение.Сообщить();
		
	КонецЕсли;   
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрогрессВыполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Прогресс <> Неопределено Тогда 
		Состояние("Выполняется серверный код", Результат.Прогресс.Процент);
	КонецЕсли;	
	
КонецПроцедуры	    

# КонецОбласти
